app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT * FROM "courses"

  def create
    @course = Course.new(params[:course])

    if @course.save
---
INSERT INTO "courses" ("name", "created_at", "updated_at", "desc") VALUES('superkurssi', '2009-11-17 18:28:42', '2009-11-17 18:28:42', 'meow!')

  def destroy
    @course.destroy
---
DELETE FROM "courses" WHERE "id" = 2

  def find_course
    @course = Course.find(params[:id])
---
SELECT * FROM "courses" WHERE ("courses"."id" = 2)