app/controllers/groups_controller.rb

INSERT INTO "groups" ("party_id", "created_at", "updated_at", "time", "ass_id", "where", "limit") VALUES(7, '2010-01-04 12:46:50', '2010-01-04 12:46:50', 'ke 16-18', 7, 'B121', NULL)
---
  def create
    @group = @party.groups.build(params[:group])

    if @group.save

SELECT * FROM "courses" WHERE ("courses"."id" = 2)
SELECT * FROM "parties" WHERE ("parties"."id" = 2)
---
  def find_course_and_party
    @course = Course.find(params[:course_id])
    @party = Party.find(params[:party_id])

SELECT * FROM "groups" WHERE ("groups"."id" = 2)
---
  def find_group
    @group = Group.find(params[:id])