app/controllers/parties_controller.rb

SELECT * FROM "groups" WHERE ("groups".party_id = 3) LIMIT 1
---
  def show
    @group = @party.groups.new

INSERT INTO "parties" ("created_at", "updated_at", "time", "desc", "course_id", "place") VALUES('2009-12-04 01:59:06', '2009-12-04 01:59:06', 'Syksy 2009', NULL, 3, NULL)
---
  def create
    @party = @course.parties.build(params[:party])

    if @party.save

SELECT * FROM "courses" WHERE ("courses"."id" = 2)
---
  def find_course
    @course = Course.find(params[:course_id])

SELECT * FROM "parties" WHERE ("parties"."id" = 1)
---
  def find_party
    @party = Party.find(params[:id])