app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "avatar_file_name", "avatar_file_size", "studentnum", "updated_at", "avatar_content_type", "pass", "avatar_updated_at") VALUES('mirri', '2009-12-14 21:57:55', NULL, NULL, NULL, '2009-12-14 21:57:55', NULL, 'pussi', NULL)
---
  def create
    @newuser = User.new(params[:user])

    if @newuser.save

SELECT * FROM "users" WHERE ("users"."id" = 2)
DELETE FROM "users" WHERE "id" = 5
---
  def destroy
   @user = User.find(params[:id])
   if @user.destroy then flash[:notice] = "User #{@user.name} deleted." end

SELECT * FROM "users" WHERE ("users"."id" = 2)
---
  def edit
    @olduser = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 2)
UPDATE "users" SET "updated_at" = '2009-12-14 21:26:13', "studentnum" = 10101001, "avatar_file_size" = 24297, "avatar_file_name" = 'gordo.png', "avatar_updated_at" = '2009-12-14 21:26:12', "avatar_content_type" = 'image/png' WHERE "id" = 2
---
  def update
    @olduser = User.find(params[:id])

    if @olduser.update_attributes(params[:user])